grevaillot/svd_tools/headers/STM32G441xx/tim8.h
/** @defgroup tim8_dier DIER DMA/Interrupt enable register
@{*/

/** TIM8_DIER_TERRIE Transition Error interrupt enable **/
#define TIM8_DIER_TERRIE		(1 << 23)
/** TIM8_DIER_IERRIE Index Error interrupt enable **/
#define TIM8_DIER_IERRIE		(1 << 22)
/** TIM8_DIER_DIRIE Direction Change interrupt enable **/
#define TIM8_DIER_DIRIE		(1 << 21)
/** TIM8_DIER_IDXIE Index interrupt enable **/
#define TIM8_DIER_IDXIE		(1 << 20)
/** TIM8_DIER_TDE Trigger DMA request enable **/
#define TIM8_DIER_TDE		(1 << 14)
/** TIM8_DIER_COMDE COM DMA request enable **/
#define TIM8_DIER_COMDE		(1 << 13)
/** TIM8_DIER_CC4DE Capture/Compare 4 DMA request enable **/
#define TIM8_DIER_CC4DE		(1 << 12)
/** TIM8_DIER_CC3DE Capture/Compare 3 DMA request enable **/
#define TIM8_DIER_CC3DE		(1 << 11)
/** TIM8_DIER_CC2DE Capture/Compare 2 DMA request enable **/
#define TIM8_DIER_CC2DE		(1 << 10)
/** TIM8_DIER_CC1DE Capture/Compare 1 DMA request enable **/
#define TIM8_DIER_CC1DE		(1 << 9)
/** TIM8_DIER_UDE Update DMA request enable **/
#define TIM8_DIER_UDE		(1 << 8)
/** TIM8_DIER_BIE Break interrupt enable **/
#define TIM8_DIER_BIE		(1 << 7)
/** TIM8_DIER_TIE Trigger interrupt enable **/
#define TIM8_DIER_TIE		(1 << 6)
/** TIM8_DIER_COMIE COM interrupt enable **/
#define TIM8_DIER_COMIE		(1 << 5)
/** TIM8_DIER_CC4IE Capture/Compare 4 interrupt enable **/
#define TIM8_DIER_CC4IE		(1 << 4)
/** TIM8_DIER_CC3IE Capture/Compare 3 interrupt enable **/
#define TIM8_DIER_CC3IE		(1 << 3)
/** TIM8_DIER_CC2IE Capture/Compare 2 interrupt enable **/
#define TIM8_DIER_CC2IE		(1 << 2)
/** TIM8_DIER_CC1IE Capture/Compare 1 interrupt enable **/
#define TIM8_DIER_CC1IE		(1 << 1)
/** TIM8_DIER_UIE Update interrupt enable **/
#define TIM8_DIER_UIE		(1 << 0)

/**@}*/

/** @defgroup tim8_sr SR status register
@{*/

/** TIM8_SR_TERRF Transition Error interrupt flag **/
#define TIM8_SR_TERRF		(1 << 23)
/** TIM8_SR_IERRF Index Error interrupt flag **/
#define TIM8_SR_IERRF		(1 << 22)
/** TIM8_SR_DIRF Direction Change interrupt flag **/
#define TIM8_SR_DIRF		(1 << 21)
/** TIM8_SR_IDXF Index interrupt flag **/
#define TIM8_SR_IDXF		(1 << 20)
/** TIM8_SR_CC6IF Compare 6 interrupt flag **/
#define TIM8_SR_CC6IF		(1 << 17)
/** TIM8_SR_CC5IF Compare 5 interrupt flag **/
#define TIM8_SR_CC5IF		(1 << 16)
/** TIM8_SR_SBIF System Break interrupt flag **/
#define TIM8_SR_SBIF		(1 << 13)
/** TIM8_SR_CC4OF Capture/Compare 4 overcapture flag **/
#define TIM8_SR_CC4OF		(1 << 12)
/** TIM8_SR_CC3OF Capture/Compare 3 overcapture flag **/
#define TIM8_SR_CC3OF		(1 << 11)
/** TIM8_SR_CC2OF Capture/compare 2 overcapture flag **/
#define TIM8_SR_CC2OF		(1 << 10)
/** TIM8_SR_CC1OF Capture/Compare 1 overcapture flag **/
#define TIM8_SR_CC1OF		(1 << 9)
/** TIM8_SR_B2IF Break 2 interrupt flag **/
#define TIM8_SR_B2IF		(1 << 8)
/** TIM8_SR_BIF Break interrupt flag **/
#define TIM8_SR_BIF		(1 << 7)
/** TIM8_SR_TIF Trigger interrupt flag **/
#define TIM8_SR_TIF		(1 << 6)
/** TIM8_SR_COMIF COM interrupt flag **/
#define TIM8_SR_COMIF		(1 << 5)
/** TIM8_SR_CC4IF Capture/Compare 4 interrupt flag **/
#define TIM8_SR_CC4IF		(1 << 4)
/** TIM8_SR_CC3IF Capture/Compare 3 interrupt flag **/
#define TIM8_SR_CC3IF		(1 << 3)
/** TIM8_SR_CC2IF Capture/Compare 2 interrupt flag **/
#define TIM8_SR_CC2IF		(1 << 2)
/** TIM8_SR_CC1IF Capture/compare 1 interrupt flag **/
#define TIM8_SR_CC1IF		(1 << 1)
/** TIM8_SR_UIF Update interrupt flag **/
#define TIM8_SR_UIF		(1 << 0)

/**@}*/

/** @defgroup tim8_egr EGR event generation register
@{*/

/** TIM8_EGR_B2G Break 2 generation **/
#define TIM8_EGR_B2G		(1 << 8)
/** TIM8_EGR_BG Break generation **/
#define TIM8_EGR_BG		(1 << 7)
/** TIM8_EGR_TG Trigger generation **/
#define TIM8_EGR_TG		(1 << 6)
/** TIM8_EGR_COMG Capture/Compare control update generation **/
#define TIM8_EGR_COMG		(1 << 5)
/** TIM8_EGR_CC4G Capture/compare 4 generation **/
#define TIM8_EGR_CC4G		(1 << 4)
/** TIM8_EGR_CC3G Capture/compare 3 generation **/
#define TIM8_EGR_CC3G		(1 << 3)
/** TIM8_EGR_CC2G Capture/compare 2 generation **/
#define TIM8_EGR_CC2G		(1 << 2)
/** TIM8_EGR_CC1G Capture/compare 1 generation **/
#define TIM8_EGR_CC1G		(1 << 1)
/** TIM8_EGR_UG Update generation **/
#define TIM8_EGR_UG		(1 << 0)

/**@}*/

/** @defgroup tim8_ccmr1_output CCMR1Output capture/compare mode register 1 (output mode)
@{*/

/** TIM8_CCMR1_Output_OC2M_3 Output Compare 2 mode - bit 3 **/
#define TIM8_CCMR1_Output_OC2M_3		(1 << 24)
/** TIM8_CCMR1_Output_OC1M_3 Output Compare 1 mode - bit 3 **/
#define TIM8_CCMR1_Output_OC1M_3		(1 << 16)
/** TIM8_CCMR1_Output_OC2CE Output Compare 2 clear enable **/
#define TIM8_CCMR1_Output_OC2CE		(1 << 15)

#define TIM8_CCMR1_Output_OC2M_SHIFT		12
#define TIM8_CCMR1_Output_OC2M_MASK		0x07
/** @defgroup tim8_ccmr1_output_oc2m OC2M Output Compare 2 mode
@{*/
/**@}*/

/** TIM8_CCMR1_Output_OC2PE Output Compare 2 preload enable **/
#define TIM8_CCMR1_Output_OC2PE		(1 << 11)
/** TIM8_CCMR1_Output_OC2FE Output Compare 2 fast enable **/
#define TIM8_CCMR1_Output_OC2FE		(1 << 10)

#define TIM8_CCMR1_Output_CC2S_SHIFT		8
#define TIM8_CCMR1_Output_CC2S_MASK		0x03
/** @defgroup tim8_ccmr1_output_cc2s CC2S Capture/Compare 2 selection
@{*/
/**@}*/

/** TIM8_CCMR1_Output_OC1CE Output Compare 1 clear enable **/
#define TIM8_CCMR1_Output_OC1CE		(1 << 7)

#define TIM8_CCMR1_Output_OC1M_SHIFT		4
#define TIM8_CCMR1_Output_OC1M_MASK		0x07
/** @defgroup tim8_ccmr1_output_oc1m OC1M Output Compare 1 mode
@{*/
/**@}*/

/** TIM8_CCMR1_Output_OC1PE Output Compare 1 preload enable **/
#define TIM8_CCMR1_Output_OC1PE		(1 << 3)
/** TIM8_CCMR1_Output_OC1FE Output Compare 1 fast enable **/
#define TIM8_CCMR1_Output_OC1FE		(1 << 2)

#define TIM8_CCMR1_Output_CC1S_SHIFT		0
#define TIM8_CCMR1_Output_CC1S_MASK		0x03
/** @defgroup tim8_ccmr1_output_cc1s CC1S Capture/Compare 1 selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim8_ccmr1_input CCMR1Input capture/compare mode register 1 (input mode)
@{*/


#define TIM8_CCMR1_Input_IC2F_SHIFT		12
#define TIM8_CCMR1_Input_IC2F_MASK		0x0f
/** @defgroup tim8_ccmr1_input_ic2f IC2F Input capture 2 filter
@{*/
/**@}*/


#define TIM8_CCMR1_Input_IC2PSC_SHIFT		10
#define TIM8_CCMR1_Input_IC2PSC_MASK		0x03
/** @defgroup tim8_ccmr1_input_ic2psc IC2PSC Input capture 2 prescaler
@{*/
/**@}*/


